Documents/ОперацияБух.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ОперацияБух</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>А1Бух_Основание</Name>
					<Comment>А1Идентификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А1Бух_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/А1Бух_УниверсальныйРегистратор/Ext/Module.bsl
#Область Механизм

Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ПриЗаписи", Истина);
	
	Возврат Настройки;
КонецФункции

Функция ПриЗаписи(Объект, Отказ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	УниверсальныйРегистратор = ПолучитьСуществующий(Объект.Ссылка);
	
	Если НЕ Объект.ПометкаУдаления Тогда
		Если НЕ ЗначениеЗаполнено(УниверсальныйРегистратор) Тогда Возврат Неопределено; КонецЕсли;
	
		УниверсальныйРегистраторОбъект = УниверсальныйРегистратор.ПолучитьОбъект();
		УниверсальныйРегистраторОбъект.ОбменДанными.Загрузка = Истина;
		Заполнить(УниверсальныйРегистраторОбъект, Объект);
		УниверсальныйРегистраторОбъект.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		Если НЕ ЗначениеЗаполнено(УниверсальныйРегистратор) Тогда Возврат Неопределено; КонецЕсли;
		
		УниверсальныйРегистраторОбъект = УниверсальныйРегистратор.ПолучитьОбъект();
		УниверсальныйРегистраторОбъект.Удалить();
	КонецЕсли;
КонецФункции

#КонецОбласти 

Функция ПолучитьСуществующий(Ссылка) Экспорт
	Возврат Документы.ОперацияБух.НайтиПоРеквизиту("А1Бух_Основание", А1Э_Метаданные.ИдентификаторПоСсылке(Ссылка));
КонецФункции

Функция Создать(ИсточникДанных) Экспорт
	УниверсальныйРегистраторОбъект = Документы.ОперацияБух.СоздатьДокумент();
	УниверсальныйРегистраторОбъект.ОбменДанными.Загрузка = Истина;
	Заполнить(УниверсальныйРегистраторОбъект, ИсточникДанных);
	УниверсальныйРегистраторОбъект.Записать(РежимЗаписиДокумента.Запись);
	Возврат УниверсальныйРегистраторОбъект; 
КонецФункции

Функция Заполнить(УниверсальныйРегистраторОбъект, ИсточникДанных) 
	Если А1Э_Общее.Свойство(ИсточникДанных, "Организация") Тогда
		УниверсальныйРегистраторОбъект.Организация = ИсточникДанных.Организация;
	КонецЕсли;
	УниверсальныйРегистраторОбъект.Дата = ИсточникДанных.Дата;
	УниверсальныйРегистраторОбъект.А1Бух_Основание = А1Э_Метаданные.ИдентификаторПоСсылке(ИсточникДанных.Ссылка);
	УниверсальныйРегистраторОбъект.А1Бух_Представление = "" + ИсточникДанных.Ссылка;
КонецФункции

Функция Получить(ИсточникДанных) Экспорт
	УниверсальныйРегистратор = ПолучитьСуществующий(ИсточникДанных.Ссылка);
	Если ЗначениеЗаполнено(УниверсальныйРегистратор) Тогда
		Возврат УниверсальныйРегистратор;
	КонецЕсли;
	Возврат Создать(ИсточникДанных).Ссылка;
КонецФункции
